In [2]:
import pandas as pd
print(pd.__version__)

1.1.4

## Persiapan dataframe

In [3]:
data = {'col1':['1', '2', '3', 'teks'],
       'col2':['1','2', '3', '4']}
df = pd.DataFrame(data)
df

   col1 col2
0     1    1
1     2    2
2     3    3
3  teks    4

In [4]:
df.dtypes

col1    object
col2    object
dtype: object

# Konversi data untuk satu kolom

In [7]:
df_int = df.astype({'col2':'int'})
df_int

   col1  col2
0     1     1
1     2     2
2     3     3
3  teks     4

In [8]:
df_int.dtypes

col1    object
col2     int64
dtype: object

In [9]:
df_float = df.astype({'col2':'float'})
df_float

   col1  col2
0     1   1.0
1     2   2.0
2     3   3.0
3  teks   4.0

In [10]:
df_int.dtypes

col1    object
col2     int64
dtype: object

## Konversi Data untuk semua kolom

In [14]:
df.apply(pd.to_numeric, errors='coerce')

   col1  col2
0   1.0     1
1   2.0     2
2   3.0     3
3   NaN     4

TypeError: arg must be a list, tuple, 1-d array, or Series